ElementSystemBase.getAddDeleteMembersParentAtoms(Arr&lt;Atom&gt;*)
append atoms a that are parents of ElementSystemAddDeleteMembersRegenStep

ElementSystemBase.getLayoutParentAtoms(Arr&lt;Atom&gt;*)
append atoms a that are parents of layout

ElementSystemBase.getTypeInfos
@return ref to m_typeInfos - do we need this?

ElementSystemBase.isAssociatedWithElem(ElementId)
Is input elem associated with any sketch line of this element system

ElementSystemBase.getHeldElem(System.Int32)
Get held elem based on location in array (input)

ElementSystemBase.purgeUnusedHeldElems
Remove held elems that have isElemSpaceActive() = false and elementId == invalidElementId
(if elemId is not invalid it has not been deleted yet)

ElementSystemBase.getHeldElemsOfTypeFW(Arr&lt;HeldElement**&gt;*,ElementTypeKey)
Add pointers to HEs in m_heldElems of type "key" to pArrHE

ElementSystemBase.getHeldElemByIdx(Arr&lt;System.Int32&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
@return held elem associated with idx

ElementSystemBase.getHeldElemByElemId(ElementId)
Get the HeldElement that is associated with this elemId

ElementSystemBase.getHeldElemFW(System.Int32)
These don't preTouchElement.  Caller must do it, be in regen, or not modify it.
get held elem based on location in array (input)